
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.content_pipeline.aws_s3_bucket.incoming has been deleted
  - resource "aws_s3_bucket" "incoming" {
      - arn                         = "arn:aws:s3:::ekelola-prod-content-incoming" -> null
      - bucket                      = "ekelola-prod-content-incoming" -> null
      - id                          = "ekelola-prod-content-incoming" -> null
        tags                        = {
            "Env"     = "prod"
            "Project" = "ekelola"
            "Stack"   = "content-pipeline"
        }
        # (11 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.content_pipeline.aws_s3_bucket.live has been deleted
  - resource "aws_s3_bucket" "live" {
      - arn                         = "arn:aws:s3:::ekelola-prod-content-live" -> null
      - bucket                      = "ekelola-prod-content-live" -> null
      - id                          = "ekelola-prod-content-live" -> null
        tags                        = {
            "Env"     = "prod"
            "Project" = "ekelola"
            "Stack"   = "content-pipeline"
        }
        # (11 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.content_pipeline.aws_s3_bucket.rejected has been deleted
  - resource "aws_s3_bucket" "rejected" {
      - arn                         = "arn:aws:s3:::ekelola-prod-content-rejected" -> null
      - bucket                      = "ekelola-prod-content-rejected" -> null
      - id                          = "ekelola-prod-content-rejected" -> null
        tags                        = {
            "Env"     = "prod"
            "Project" = "ekelola"
            "Stack"   = "content-pipeline"
        }
        # (11 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.content_pipeline.data.aws_iam_policy_document.trigger_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "trigger_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + resources = [
              + "arn:aws:secretsmanager:eu-west-2:350445798378:secret:ekelola/github/pat_content_sync-04aRhB",
            ]
        }
      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "kms:Decrypt",
            ]
          + resources = [
              + "arn:aws:kms:eu-west-2:350445798378:key/127ea7b7-1924-4a34-9e24-faa6645bd68f",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + resources = [
              + "arn:aws:sqs:eu-west-2:350445798378:ekelola-prod-content-dlq",
            ]
        }
    }

  # module.content_pipeline.data.aws_iam_policy_document.validate_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "validate_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + resources = [
              + "arn:aws:sqs:eu-west-2:350445798378:ekelola-prod-content-dlq",
            ]
        }
      + statement {
          + actions   = [
              + "kms:Decrypt",
              + "kms:Encrypt",
              + "kms:GenerateDataKey",
            ]
          + resources = [
              + "arn:aws:kms:eu-west-2:350445798378:key/127ea7b7-1924-4a34-9e24-faa6645bd68f",
            ]
        }
    }

  # module.content_pipeline.aws_iam_policy.trigger_policy will be updated in-place
  ~ resource "aws_iam_policy" "trigger_policy" {
        id               = "arn:aws:iam::350445798378:policy/ekelola-prod-trigger-policy"
        name             = "ekelola-prod-trigger-policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:secretsmanager:eu-west-2:350445798378:secret:ekelola/github/pat_content_sync-04aRhB"
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "kms:Decrypt"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:kms:eu-west-2:350445798378:key/127ea7b7-1924-4a34-9e24-faa6645bd68f"
                    },
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::ekelola-prod-content-live/*",
                          - "arn:aws:s3:::ekelola-prod-content-live",
                        ]
                    },
                  - {
                      - Action   = "sqs:SendMessage"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sqs:eu-west-2:350445798378:ekelola-prod-content-dlq"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.content_pipeline.aws_iam_policy.validate_policy will be updated in-place
  ~ resource "aws_iam_policy" "validate_policy" {
        id               = "arn:aws:iam::350445798378:policy/ekelola-prod-validate-policy"
        name             = "ekelola-prod-validate-policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::ekelola-prod-content-incoming/*"
                    },
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::ekelola-prod-content-rejected/*",
                          - "arn:aws:s3:::ekelola-prod-content-live/*",
                        ]
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "sqs:SendMessage"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sqs:eu-west-2:350445798378:ekelola-prod-content-dlq"
                    },
                  - {
                      - Action   = [
                          - "kms:GenerateDataKey",
                          - "kms:Encrypt",
                          - "kms:Decrypt",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:kms:eu-west-2:350445798378:key/127ea7b7-1924-4a34-9e24-faa6645bd68f"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.content_pipeline.aws_lambda_permission.allow_s3_incoming must be replaced
-/+ resource "aws_lambda_permission" "allow_s3_incoming" {
      ~ id                  = "AllowS3InvokeValidate" -> (known after apply)
      ~ source_arn          = "arn:aws:s3:::ekelola-prod-content-incoming" # forces replacement -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.content_pipeline.aws_lambda_permission.allow_s3_live must be replaced
-/+ resource "aws_lambda_permission" "allow_s3_live" {
      ~ id                  = "AllowS3InvokeTrigger" -> (known after apply)
      ~ source_arn          = "arn:aws:s3:::ekelola-prod-content-live" # forces replacement -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.content_pipeline.aws_s3_bucket.incoming will be created
  + resource "aws_s3_bucket" "incoming" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "ekelola-prod-content-incoming"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Env"     = "prod"
          + "Project" = "ekelola"
          + "Stack"   = "content-pipeline"
        }
      + tags_all                    = {
          + "Env"     = "prod"
          + "Project" = "ekelola"
          + "Stack"   = "content-pipeline"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.content_pipeline.aws_s3_bucket.live will be created
  + resource "aws_s3_bucket" "live" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "ekelola-prod-content-live"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Env"     = "prod"
          + "Project" = "ekelola"
          + "Stack"   = "content-pipeline"
        }
      + tags_all                    = {
          + "Env"     = "prod"
          + "Project" = "ekelola"
          + "Stack"   = "content-pipeline"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.content_pipeline.aws_s3_bucket.rejected will be created
  + resource "aws_s3_bucket" "rejected" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "ekelola-prod-content-rejected"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Env"     = "prod"
          + "Project" = "ekelola"
          + "Stack"   = "content-pipeline"
        }
      + tags_all                    = {
          + "Env"     = "prod"
          + "Project" = "ekelola"
          + "Stack"   = "content-pipeline"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.content_pipeline.aws_s3_bucket_lifecycle_configuration.lc_incoming must be replaced
-/+ resource "aws_s3_bucket_lifecycle_configuration" "lc_incoming" {
      ~ bucket                                 = "ekelola-prod-content-incoming" # forces replacement -> (known after apply) # forces replacement
      + expected_bucket_owner                  = (known after apply)
      ~ id                                     = "ekelola-prod-content-incoming" -> (known after apply)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.content_pipeline.aws_s3_bucket_lifecycle_configuration.lc_live must be replaced
-/+ resource "aws_s3_bucket_lifecycle_configuration" "lc_live" {
      ~ bucket                                 = "ekelola-prod-content-live" # forces replacement -> (known after apply) # forces replacement
      + expected_bucket_owner                  = (known after apply)
      ~ id                                     = "ekelola-prod-content-live" -> (known after apply)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.content_pipeline.aws_s3_bucket_lifecycle_configuration.lc_rejected must be replaced
-/+ resource "aws_s3_bucket_lifecycle_configuration" "lc_rejected" {
      ~ bucket                                 = "ekelola-prod-content-rejected" # forces replacement -> (known after apply) # forces replacement
      + expected_bucket_owner                  = (known after apply)
      ~ id                                     = "ekelola-prod-content-rejected" -> (known after apply)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.content_pipeline.aws_s3_bucket_notification.incoming_notify must be replaced
-/+ resource "aws_s3_bucket_notification" "incoming_notify" {
      ~ bucket      = "ekelola-prod-content-incoming" # forces replacement -> (known after apply) # forces replacement
      ~ id          = "ekelola-prod-content-incoming" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ lambda_function {
          ~ id                  = "tf-s3-lambda-20250914131304302800000001" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.content_pipeline.aws_s3_bucket_notification.live_notify must be replaced
-/+ resource "aws_s3_bucket_notification" "live_notify" {
      ~ bucket      = "ekelola-prod-content-live" # forces replacement -> (known after apply) # forces replacement
      ~ id          = "ekelola-prod-content-live" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ lambda_function {
          ~ id                  = "tf-s3-lambda-20250914130242561100000006" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.content_pipeline.aws_s3_bucket_public_access_block.pab_incoming must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "pab_incoming" {
      ~ bucket                  = "ekelola-prod-content-incoming" # forces replacement -> (known after apply) # forces replacement
      ~ id                      = "ekelola-prod-content-incoming" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.content_pipeline.aws_s3_bucket_public_access_block.pab_live must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "pab_live" {
      ~ bucket                  = "ekelola-prod-content-live" # forces replacement -> (known after apply) # forces replacement
      ~ id                      = "ekelola-prod-content-live" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.content_pipeline.aws_s3_bucket_public_access_block.pab_rejected must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "pab_rejected" {
      ~ bucket                  = "ekelola-prod-content-rejected" # forces replacement -> (known after apply) # forces replacement
      ~ id                      = "ekelola-prod-content-rejected" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.content_pipeline.aws_s3_bucket_server_side_encryption_configuration.sse_incoming must be replaced
-/+ resource "aws_s3_bucket_server_side_encryption_configuration" "sse_incoming" {
      ~ bucket                = "ekelola-prod-content-incoming" # forces replacement -> (known after apply) # forces replacement
      ~ id                    = "ekelola-prod-content-incoming" -> (known after apply)
        # (1 unchanged attribute hidden)

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - kms_master_key_id = "arn:aws:kms:eu-west-2:350445798378:key/127ea7b7-1924-4a34-9e24-faa6645bd68f" -> null
              - sse_algorithm     = "aws:kms" -> null
            }
        }
      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = "arn:aws:kms:eu-west-2:350445798378:key/127ea7b7-1924-4a34-9e24-faa6645bd68f"
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.content_pipeline.aws_s3_bucket_server_side_encryption_configuration.sse_live must be replaced
-/+ resource "aws_s3_bucket_server_side_encryption_configuration" "sse_live" {
      ~ bucket                = "ekelola-prod-content-live" # forces replacement -> (known after apply) # forces replacement
      ~ id                    = "ekelola-prod-content-live" -> (known after apply)
        # (1 unchanged attribute hidden)

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - kms_master_key_id = "arn:aws:kms:eu-west-2:350445798378:key/127ea7b7-1924-4a34-9e24-faa6645bd68f" -> null
              - sse_algorithm     = "aws:kms" -> null
            }
        }
      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = "arn:aws:kms:eu-west-2:350445798378:key/127ea7b7-1924-4a34-9e24-faa6645bd68f"
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.content_pipeline.aws_s3_bucket_server_side_encryption_configuration.sse_rejected must be replaced
-/+ resource "aws_s3_bucket_server_side_encryption_configuration" "sse_rejected" {
      ~ bucket                = "ekelola-prod-content-rejected" # forces replacement -> (known after apply) # forces replacement
      ~ id                    = "ekelola-prod-content-rejected" -> (known after apply)
        # (1 unchanged attribute hidden)

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - kms_master_key_id = "arn:aws:kms:eu-west-2:350445798378:key/127ea7b7-1924-4a34-9e24-faa6645bd68f" -> null
              - sse_algorithm     = "aws:kms" -> null
            }
        }
      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = "arn:aws:kms:eu-west-2:350445798378:key/127ea7b7-1924-4a34-9e24-faa6645bd68f"
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.content_pipeline.aws_s3_bucket_versioning.v_incoming must be replaced
-/+ resource "aws_s3_bucket_versioning" "v_incoming" {
      ~ bucket                = "ekelola-prod-content-incoming" # forces replacement -> (known after apply) # forces replacement
      ~ id                    = "ekelola-prod-content-incoming" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ versioning_configuration {
          + mfa_delete = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.content_pipeline.aws_s3_bucket_versioning.v_live must be replaced
-/+ resource "aws_s3_bucket_versioning" "v_live" {
      ~ bucket                = "ekelola-prod-content-live" # forces replacement -> (known after apply) # forces replacement
      ~ id                    = "ekelola-prod-content-live" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ versioning_configuration {
          + mfa_delete = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.content_pipeline.aws_s3_bucket_versioning.v_rejected must be replaced
-/+ resource "aws_s3_bucket_versioning" "v_rejected" {
      ~ bucket                = "ekelola-prod-content-rejected" # forces replacement -> (known after apply) # forces replacement
      ~ id                    = "ekelola-prod-content-rejected" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ versioning_configuration {
          + mfa_delete = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.site.aws_cloudfront_function.redirect_www[0] will be updated in-place
  ~ resource "aws_cloudfront_function" "redirect_www" {
      ~ code                         = <<-EOT
          - function handler(event) {
          + function handler(event) {
          -   var req = event.request;
          +   var req = event.request;
          -   var host = req.headers.host.value.toLowerCase();
          +   var host = req.headers.host.value.toLowerCase();
          -   if (host.slice(0,4) === "www.") {
          +   if (host.slice(0,4) === "www.") {
          -     var location = "https://ekelola.com" + req.uri;
          +     var location = "https://ekelola.com" + req.uri;
          -     return {
          +     return {
          -       statusCode: 301,
          +       statusCode: 301,
          -       statusDescription: "Moved Permanently",
          +       statusDescription: "Moved Permanently",
          -       headers: { "location": { "value": location } }
          +       headers: { "location": { "value": location } }
          -     };
          +     };
          -   }
          +   }
          -   return req;
          +   return req;
            }
        EOT
        id                           = "ekelola-redirect-www"
        name                         = "ekelola-redirect-www"
        # (8 unchanged attributes hidden)
    }

Plan: 19 to add, 3 to change, 16 to destroy.

<!-- Sticky Pull Request Comment -->